<?php

namespace Database\Seeders;

use App\Models\ElectiveSubject;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ElectiveSubjectSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run()
    {
        $subjects = [
            'Паразитологія',
            'Флора та рослинність України',
            'Біоетика та біобезпека',
            'Хімія харчових продуктів',
            'Основи домедичної допомоги',
            'Основи репродуктивного здоров’я',
            'Основи екології',
            'Основи програмування мовою C#',
            'Основи програмування мовою Python',
            'Основи вебдизайну',
            'Музична акустика',
            'Астрономія',
            'Технічні засоби та технології дистанційного навчання',
            'Академічна мобільність та студентська проєктна діяльність',
            'Основи кібербезпеки',
            'Соціологія',
            'Політологія',
            'Європа як цивілізаційний проєкт',
            'Історія української культури',
            'Релігієзнавство',
            'Філософія дитинства',
            'Історія мистецтва',
            'Етика та естетика',
            'Філософія літератури',
            'Людяність як категорія філософії та педагогіки',
            'Природа обдарованості: філософсько-освітній вимір',
            'Українознавство',
            'Історія театру',
            'Культурологія',
            'Україна в Європі і світі',
            'Цивілізаційні засади всесвітньої історії',
            'Іван Франко в інтелектуальному просторі Центрально-Східної Європи',
            'Нумізматика',
            'Основи пам’яткознавства',
            'Народи Близького Сходу (ХVІІ – початок ХХІ ст.)',
            'Історія ОУН і УПА',
            'Історія українського війська',
            'Історія української науки і техніки',
            'Історія сучасного світу',
            'Історія християнства в Україні',
            'Трудове право України',
            'Сімейне право України',
            'Правознавство',
            'Основи підприємництва',
            'Математичні методи в природничих та гуманітарних науках',
            'Поезія Тараса Шевченка',
            'Феномен Івана Франка',
            'Драми Лесі Українки',
            'Вершини української літератури',
            'Концепт кохання у світовій літературі',
            'Польська мова для початківців (А1)',
            'Польська мова для початківців (А2)',
            'Сучасна європейська та українська жіноча проза: ментальні виклики',
            'Мовотворчість Ліни Костенко',
            'Власна назва в контексті мови, історії та культури',
            'Волонтерська діяльність',
            'Арт-педагогіка та арт-терапія в роботі з дітьми та молоддю',
            'Соціальне виховання',
            'Міжнародна студентська мобільність',
            'Українська народна сорочка',
            'Інтенсивний курс французької мови для початківців',
            'Освітні новації у концепції нової української школи',
            'Англійська мова у галузі інформаційних технологій',
            'Сучасні технології інклюзивної освіти',
            'Новації у педагогіці',
            'Педагогіка Василя Сухомлинського',
            'Педагогіка дозвілля',
            'Родинна педагогіка',
            'Психологія здоров’я людини',
            'Психологія конфлікту',
            'Психологія кар’єри',
            'Психопрофілактика залежної поведінки',
            'Психічна травма та шляхи її подолання',
            'Психологія посттравматичного розвитку',
        ];

        // Додавання вибіркових дисциплін у таблицю elective_subjects
        foreach ($subjects as $subject) {
            ElectiveSubject::create([
                'name' => $subject,
            ]);
        }
    }
}
